<?php

return [
    'admin' => [
        'admins' => [
            'get_err' => '管理者の取得に失敗しました',
            'create_msg' => '管理者の登録を完了しました',
            'create_err' => '管理者の登録に失敗しました',
            'update_msg' => '管理者の編集を完了しました',
            'update_err' => '管理者の編集に失敗しました',
            'delete_msg' => '管理者の削除を完了しました',
            'delete_err' => '管理者の削除に失敗しました',
            'csv_header' => ['No', 'ID', '氏名', '電話番号', 'メールアドレス', '作成日時', '更新日時'],
            'csv_file_name' => '管理者情報.csv',
            'csv_err' => '管理者情報CSVの出力に失敗しました'
        ],
        'auth' => [
            'login_msg' => 'ログインに成功しました',
            'login_err' => 'ログインに失敗しました',
            'logout_msg' => 'ログアウトに成功しました',
            'logout_err' => 'ログアウトに失敗しました'
        ],
        'blogs' => [
            'get_err' => 'ブログの取得に失敗しました',
            'create_msg' => 'ブログの登録を完了しました',
            'create_err' => 'ブログの登録に失敗しました',
            'update_msg' => 'ブログの編集を完了しました',
            'update_err' => 'ブログの編集に失敗しました',
            'delete_msg' => 'ブログの削除を完了しました',
            'delete_err' => 'ブログの削除に失敗しました',
            'csv_header' => ['No', 'ID', '公開状況', 'タイトル', 'ブランド', 'カテゴリー', '関連品番', '関連タグ', '最終更新者', '投稿日時', '更新日時'],
            'csv_file_name' => 'ブログ情報.csv',
            'csv_err' => 'ブログ情報CSVの出力に失敗しました'
        ],
        'brands' => [
            'get_err' => 'ブランドマスタの取得に失敗しました',
            'create_msg' => 'ブランドマスタの登録を完了しました',
            'create_err' => 'ブランドマスタの登録に失敗しました',
            'update_msg' => 'ブランドマスタの編集を完了しました',
            'update_err' => 'ブランドマスタの編集に失敗しました',
            'delete_msg' => 'ブランドマスタの削除を完了しました',
            'delete_err' => 'ブランドマスタの削除に失敗しました',
            'delete_err2' => '選択ブランドが商品・ニュース・ブログ等で使用されております'
        ],
        'categories' => [
            'get_err' => 'カテゴリーマスタの取得に失敗しました',
            'create_msg' => 'カテゴリーマスタの登録を完了しました',
            'create_err' => 'カテゴリーマスタの登録に失敗しました',
            'update_msg' => 'カテゴリーマスタの編集を完了しました',
            'update_err' => 'カテゴリーマスタの編集に失敗しました',
            'delete_msg' => 'カテゴリーマスタの削除を完了しました',
            'delete_err' => 'カテゴリーマスタの削除に失敗しました',
            'delete_err2' => '選択カテゴリーが商品・ニュース・ブログ等で使用されおります',
            'delete_err3' => '先に選択カテゴリに紐づく子カテゴリを削除する必要があります'
        ],
        'colors' => [
            'get_err' => 'カラーマスタの取得に失敗しました',
            'create_msg' => 'カラーマスタの登録を完了しました',
            'create_err' => 'カラーマスタの登録に失敗しました',
            'update_msg' => 'カラーマスタの編集を完了しました',
            'update_err' => 'カラーマスタの編集に失敗しました',
            'delete_msg' => 'カラーマスタの削除を完了しました',
            'delete_err' => 'カラーマスタの削除に失敗しました',
            'delete_err2' => '選択カラーが商品で使用されております'
        ],
        'contacts' => [
            'get_err' => 'お問い合わせの取得に失敗しました',
            'update_msg' => 'お問い合わせの編集を完了しました',
            'update_err' => 'お問い合わせの編集に失敗しました',
            'delete_msg' => 'お問い合わせの削除を完了しました',
            'delete_err' => 'お問い合わせの削除に失敗しました',
            'csv_header' => ['No', 'ID', '会員ID', '氏名', '氏名(カナ)', '電話番号', 'メールアドレス', 'お問い合わせ日', '件名', '本文', '対応状況', '対応者', '備考欄', '更新日時'],
            'csv_file_name' => 'お問い合わせ情報.csv',
            'csv_err' => 'お問い合わせ情報CSVの出力に失敗しました'
        ],
        'items' => [
            'get_err' => '商品の取得に失敗しました',
            'create_msg' => '商品の登録を完了しました',
            'create_err' => '商品の登録に失敗しました',
            'update_msg' => '商品の編集を完了しました',
            'update_err' => '商品の編集に失敗しました',
            'delete_msg' => '商品の削除を完了しました',
            'delete_err' => '商品の削除に失敗しました',
            'delete_size_msg' => '商品サイズの削除を完了しました',
            'delete_size_err' => '商品サイズの削除に失敗しました',
            'delete_sku_msg' => '商品SKUの削除を完了しました',
            'delete_sku_err' => '商品SKUの削除に失敗しました',
            'delete_img_msg' => '商品画像の削除を完了しました',
            'delete_img_err' => '商品画像の削除に失敗しました',
            'csv_header' => ['No', 'ID', '公開状況', '品番', '商品名', '価格', '原価', 'カラー展開', 'サイズ展開', '生産国', '混用率', 'ブランドカテゴリー', '性別カテゴリー', 'メインカテゴリー', 'サブカテゴリー', '関連タグ', '最終更新者', '投稿日時', '更新日時'],
            'csv_file_name' => '商品情報.csv',
            'csv_err' => '商品情報CSVの出力に失敗しました'
        ],
        'news' => [
            'get_err' => 'ニュースの取得に失敗しました',
            'create_msg' => 'ニュースの登録を完了しました',
            'create_err' => 'ニュースの登録に失敗しました',
            'update_msg' => 'ニュースの編集を完了しました',
            'update_err' => 'ニュースの編集に失敗しました',
            'delete_msg' => 'ニュースの削除を完了しました',
            'delete_err' => 'ニュースの削除に失敗しました',
            'csv_header' => ['No', 'ID', '公開状況', 'タイトル', 'ブランド', 'カテゴリー', '関連タグ', '最終更新者', '投稿日時', '更新日時'],
            'csv_file_name' => 'ニュース情報.csv',
            'csv_err' => 'ニュース情報CSVの出力に失敗しました'
        ],
        'notifications' => [
            'get_err' => 'お知らせの取得に失敗しました',
            'create_msg' => 'お知らせの登録を完了しました',
            'create_err' => 'お知らせの登録に失敗しました',
            'update_msg' => 'お知らせの編集を完了しました',
            'update_err' => 'お知らせの編集に失敗しました',
            'delete_msg' => 'お知らせの削除を完了しました',
            'delete_err' => 'お知らせの削除に失敗しました',
            'csv_header' => ['No', 'ID', '公開状況', 'タイトル', '本文', '最終更新者', '掲載終了日', '投稿日時', '更新日時'],
            'csv_file_name' => 'お知らせ情報.csv',
            'csv_err' => 'お知らせ情報CSVの出力に失敗しました'
        ],
        'orders' => [
            'get_err' => '受注の取得に失敗しました',
            'update_msg' => '受注の編集を完了しました',
            'update_err' => '受注の編集に失敗しました',
            'delete_msg' => '受注の削除を完了しました',
            'delete_err' => '受注の削除に失敗しました',
            'csv_header' => ['No', 'ID', '購入日', '購入金額', '支払方法', '決済トークン', '希望配達日', '希望配達時間帯', '入金状況', '配送状況', '購入者(カナ)', '連絡先', 'メールアドレス', '配送先 郵便番号', '配送先 住所', '更新日時'],
            'csv_file_name' => '受注情報.csv',
            'csv_err' => '受注情報CSVの出力に失敗しました'
        ],
        'reset_passwords' => [
            'send_msg' => 'パスワード再設定メールを送信しました',
            'send_err' => '該当のユーザーが存在しません',
            'send_err2' => 'パスワード再設定メールを送信に失敗しました',
            'change_msg' => 'パスワード変更を完了しました',
            'change_err' => '該当のレコードが存在しません',
            'change_err2' => '有効期限が切れております',
            'change_err3' => '該当のユーザーが存在しません',
            'change_err4' => 'パスワード変更に失敗しました'
        ],
        'sizes' => [
            'get_err' => 'サイズマスタの取得に失敗しました',
            'create_msg' => 'サイズマスタの登録を完了しました',
            'create_err' => 'サイズマスタの登録に失敗しました',
            'update_msg' => 'サイズマスタの編集を完了しました',
            'update_err' => 'サイズマスタの編集に失敗しました',
            'delete_msg' => 'サイズマスタの削除を完了しました',
            'delete_err' => 'サイズマスタの削除に失敗しました',
            'delete_err2' => '選択サイズが商品で使用されております'
        ],
        'tags' => [
            'get_err' => 'タグマスタの取得に失敗しました',
            'create_msg' => 'タグマスタの登録を完了しました',
            'create_err' => 'タグマスタの登録に失敗しました',
            'update_msg' => 'タグマスタの編集を完了しました',
            'update_err' => 'タグマスタの編集に失敗しました',
            'delete_msg' => 'タグマスタの削除を完了しました',
            'delete_err' => 'タグマスタの削除に失敗しました',
            'delete_err2' => '選択タグが商品・ニュース・ブログ等で使用されております'
        ],
        'users' => [
            'get_err' => '会員の取得に失敗しました',
            'create_msg' => '会員の登録を完了しました',
            'create_err' => '会員の登録に失敗しました',
            'update_msg' => '会員の編集を完了しました',
            'update_err' => '会員の編集に失敗しました',
            'delete_msg' => '会員の削除を完了しました',
            'delete_err' => '会員の削除に失敗しました',
            'csv_header' => ['No', 'ID', '氏名', '氏名（カナ）', '性別', '生年月日', '郵便番号', '住所', '配送先-郵便番号', '配送先-住所', '電話番号', 'メールアドレス', 'DM登録', '作成日時', '更新日時'],
            'csv_file_name' => '会員情報.csv',
            'csv_err' => '会員情報CSVの出力に失敗しました'
        ]
    ],
    'user' => [
        'auth' => [
            'login_msg' => 'ログインに成功しました',
            'login_err' => 'ログインに失敗しました',
            'logout_msg' => 'ログアウトに成功しました',
            'logout_err' => 'ログアウトに失敗しました'
        ],
        'blogs' => [
            'get_err' => 'ブログの取得に失敗しました'
        ],
        'bookmarks' => [
            'get_err' => 'お気に入り商品の取得に失敗しました',
            'create_msg' => 'お気に入り商品の登録を完了しました',
            'create_err' => 'お気に入り商品の登録に失敗しました',
            'delete_msg' => 'お気に入り商品の削除を完了しました',
            'delete_err' => 'お気に入り商品の削除に失敗しました'
        ],
        'carts' => [
            'get_err' => 'カート商品の取得に失敗しました',
            'create_msg' => 'カート商品の登録を完了しました',
            'create_err' => 'カート商品の登録に失敗しました',
            'update_msg' => 'カート商品の編集を完了しました',
            'update_err' => 'カート商品の編集に失敗しました',
            'delete_msg' => 'カート商品の削除を完了しました',
            'delete_err' => 'カート商品の削除に失敗しました'
        ],
        'contacts' => [
            'create_msg' => 'お問い合わせの登録を完了しました',
            'create_err' => 'お問い合わせの登録に失敗しました'
        ],
        'top' => [
            'get_err' => 'TOPページの取得に失敗しました'
        ],
        'items' => [
            'get_err' => '商品の取得に失敗しました',
            'get_err2' => 'お探しの商品が見つかりませんでした。非公開または削除された可能性があります。',
            'get_err3' => '商品ランキングの取得に失敗しました',
            'get_err4' => 'おすすめ商品の取得に失敗しました',
            'get_err5' => '新着商品の取得に失敗しました',
            'get_err6' => 'オプションの取得に失敗しました'
        ],
        'news' => [
            'get_err' => 'ニュースの取得に失敗しました'
        ],
        'notifications' => [
            'get_err' => 'お知らせの取得に失敗しました'
        ],
        'orders' => [
            'get_err' => 'カート商品の取得に失敗しました',
            'create_msg' => '決済を完了しました',
            'create_err' => '商品の注文数が在庫数を超えております',
            'create_err2' => '商品の価格が一致しません',
            'create_err3' => '決済に失敗しました'
        ],
        'reset_passwords' => [
            'send_msg' => 'パスワード再設定メールを送信しました',
            'send_err' => '該当のユーザーが存在しません',
            'send_err2' => 'パスワード再設定メールを送信に失敗しました',
            'change_msg' => 'パスワード変更を完了しました',
            'change_err' => '該当のレコードが存在しません',
            'change_err2' => '有効期限が切れております',
            'change_err3' => '該当のユーザーが存在しません',
            'change_err4' => 'パスワード変更に失敗しました'
        ],
        'users' => [
            'get_err' => '会員情報の取得に失敗しました',
            'create_msg' => '会員情報の登録を完了しました',
            'create_err' => '会員情報の登録に失敗しました',
            'update_msg' => '会員情報の編集を完了しました',
            'update_err' => '会員情報の編集に失敗しました',
            'delete_msg' => '退会を完了しました',
            'delete_err' => '退会に失敗しました'
        ]
    ],
    'error' => [
        '401' => '認証エラーが発生しました',
        '404' => 'リソースが存在しません',
        '405' => '未許可のメソッドが実行されております',
        '408' => 'リクエストが時間内に完了出来ませんでした',
        '414' => 'URIの長さがサーバーの上限を超えてます',
        '415' => 'メディア形式が正しくありません',
        '429' => 'APIの利用上限を超過しています',
        '400' => '無効なリクエストです',
        '503' => '一時的にAPIアクセスが出来ません',
        '500' => 'サーバーで何らかの異常が発生しました'
    ],
    'const' => [
        'gender' => [0 => '男性', 1 => '女性', 2 => 'その他', 3 => '無回答'],
        'is_received' => [0 => '未登録', 1 => '登録済'],
        'response_status' => [0 => '未対応', 1 => '対応中', 2 => '対応済'],
        'is_published' => [0 => '非公開', 1 => '公開中'],
        'payment_method' => [0 => 'クレジットカード', 1 => '代引き'],
        'is_paid' => [0 => '未入金', 1 => '入金済'],
        'is_shipped' => [0 => '未配送', 1 => '配送済'],
        'category_id' => [1 => 'メンズ', 2 => 'レディース']
    ]
];
