<?php

return [
    'admin' => [
        'from' => [
            "name" => "【通知】XXXXアプリ",   // メール送信元名
        ],
        'change_password' => [
            'subject' => 'パスワード変更完了のお知らせ',
            "honorific" => ":name 様",
            "p1" => "パスワード変更のリクエストを承りましたことをお知らせいたします。",
            "p2" => "この変更にお心当たりがない場合には、パスワードをリセットしてアカウントを保護してください。",
            "p3" => "以下のリンクをクリックしてパスワードリセット出来ます。",
            "p4" => "【パスワードリセットページ】",
            "p5" => "パスワードリセットページはこちらから"
        ],
        'contact' => [
            'subject' => 'お問い合わせのお知らせ',
            "support_team" => "お問い合わせサポート担当者 様",
            "p1" => "下記の内容でお問い合わせを承りましたことをお知らせいたします。",
            "created_at" => "【お問い合わせ日】",
            "user_name" => "【お客様氏名】",
            "email" => "【お客様メールアドレス】",
            "subject2" => "【お問い合わせ件名】",
            "message" => "【お問い合わせ本文】"
        ],
        'order' => [
            'subject' => '受注・決済完了のお知らせ',
            "support_team" => "受注担当者 様",
            "p1" => "下記の内容でご注文を承り、決済を確認したことをお知らせいたします。",
            "p2" => "(ご注文金額の金額は、消費税総額表示です)",
            "order_id" => "【決済番号】",
            "full_name" => "【ご注文者】",
            "created_at" => "【ご注文日】",
            "total_amount" => "【ご注文金額】",
            "tax_amount" => "(内 消費税 ¥:tax)",
            "payment_method" => "【決済方法】",
            "credit_card" => "クレジットカード",
            "order_items" => "【ご注文商品】",
            "product_number" => "品番",
            "item_name" => "商品名",
            "order_size" => "サイズ",
            "order_color" => "カラー",
            "order_quantity" => "数量",
            "order_price" => "価格",
            "tax_excluded" => "(税別)"
        ],
        'reset_password' => [
            'subject' => 'パスワード再設定について',
            "honorific" => ":name 様",
            "p1" => "パスワード再設定のリクエストを承りましたことをお知らせいたします。",
            "p2" => "以下のリンクをクリックしてパスワードを変更出来ます。",
            "p3" => "【パスワード再設定リンク】",
            "p4" => "パスワード再設定はこちらから",
            "p5" => "【パスワード再設定の有効期限】",
            "p6" => "もしあなたがパスワード再設定をリクエストしていない場合は、このメールを無視して下さい。",
            "p7" => "上記リンクをクリックして新しいパスワードを作成しない限り、パスワードは変更されません。",
            "p8" => "上記のリンクには有効期限がございます。",
            "p9" => "有効期限を過ぎた場合は上記のリンクにアクセス出来なくなります。",
            "p10" => "予めご了承のほど、何卒宜しくお願い申し上げます。"
        ]
    ],
    'user' => [
        'from' => [
            "name" => "【運営会社】XXXXカンパニー",   // メール送信元名
        ],
        'change_password' => [
            'subject' => 'パスワード変更完了のお知らせ',
            "p1" => "パスワード変更のリクエストを承りましたことをお知らせいたします。",
            "p2" => "この変更にお心当たりがない場合には、パスワードをリセットしてアカウントを保護してください。",
            "p3" => "以下のリンクをクリックしてパスワードリセット出来ます。",
            "p4" => "【パスワードリセットページ】",
            "p5" => "パスワードリセットページはこちらから"
        ],
        'contact' => [
            'subject' => 'お問い合わせ完了のお知らせ',
            "p1" => "下記の内容でお問い合わせを承りましたことをお知らせいたします。",
            "created_at" => "【お問い合わせ日】",
            "subject2" => "【お問い合わせ件名】",
            "message" => "【お問い合わせ本文】",
            "notice1" => "担当者よりお問い合わせ頂いた内容に返信致します。",
            "notice2" => "返信にはお問い合わせ状況によって、数日かかる場合が御座います。",
            "notice3" => "予めご了承のほど、何卒宜しくお願い申し上げます。"
        ],
        'order' => [
            'subject' => 'ご注文・決済完了のお知らせ',
            "p1" => "下記の内容でご注文を承り、決済を確認したことをお知らせいたします。",
            "p2" => "(ご注文金額の金額は、消費税総額表示です)",
            "order_id" => "【決済番号】",
            "full_name" => "【ご注文者】",
            "created_at" => "【ご注文日】",
            "total_amount" => "【ご注文金額】",
            "tax_amount" => "(内 消費税 ¥:tax)",
            "payment_method" => "【決済方法】",
            "credit_card" => "クレジットカード",
            "order_items" => "【ご注文商品】",
            "product_number" => "品番",
            "item_name" => "商品名",
            "order_size" => "サイズ",
            "order_color" => "カラー",
            "order_quantity" => "数量",
            "order_price" => "価格",
            "tax_excluded" => "(税別)",
            "notice1" => "※ご注文の決済完了と同時に手配をさせていただいておりますので、",
            "notice2" => "当サイトを通じてご注文のキャンセル手続きはできません。",
            "notice3" => "下記運営会社まで直接連絡をお願いいたします。"
        ],
        'reset_password' => [
            'subject' => 'パスワード再設定について',
            "p1" => "パスワード再設定のリクエストを承りましたことをお知らせいたします。",
            "p2" => "以下のリンクをクリックしてパスワードを変更出来ます。",
            "p3" => "【パスワード再設定リンク】",
            "p4" => "パスワード再設定はこちらから",
            "p5" => "【パスワード再設定の有効期限】",
            "p6" => "もしあなたがパスワード再設定をリクエストしていない場合は、このメールを無視して下さい。",
            "p7" => "上記リンクをクリックして新しいパスワードを作成しない限り、パスワードは変更されません。",
            "p8" => "上記のリンクには有効期限がございます。",
            "p9" => "有効期限を過ぎた場合は上記のリンクにアクセス出来なくなります。",
            "p10" => "予めご了承のほど、何卒宜しくお願い申し上げます。"
        ],
        'common' => [
            "honorific" => ":name 様",
            "thanks_greeting" => "平素は、当社のサービスをご利用いただき、誠にありがとうございます。",
            "noreply_notice1" => "※このメールは自動送信です。",
            "noreply_notice2" => "返信いただいても回答できませんので、ご了承ください。",
            "noreply_notice3" => "なお、ご不明な点がございましたら、下記の運営会社までお問い合わせください。",
            "contact" => "【お問い合わせ先】",
            "company" => "運営会社",
            "company_ex" => "XXXX運営株式会社",
            "address" => "住所",
            "address_ex" => "〒XXX-XXXX テスト県テスト市テスト町1-2-3 テストビルディング 1F"
        ]
    ]
];
